Catalogs/ПодразделенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодразделенияКомпании</Name>
			<Comment>Подразделения компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс автонумерации для документов (до 3-х букв)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦенДокументамиПоступления</Name>
					<Comment>Установка цен документами поступления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗакупочнуюЦену</Name>
					<Comment>Формировать закупочную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНормативнуюЦену</Name>
					<Comment>Формировать нормативную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоПриходу</Name>
					<Comment>Переоценивать розничные остатки при оприходовании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоРасходу</Name>
					<Comment>Переоценивать розничные остатки при списании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Балансовое</Name>
					<Comment>Признак того, что подразделение является балансовым</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Основная валюта подразделения. Подставляется по умолчанию в новые документы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Основной банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТД</Name>
					<Comment>Ответственный за тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСервиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого подразделения, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОПЗарегистрировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрошивкаНаФРОбновлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailСервисБюро</Name>
					<Comment>обезличеный Email сервис-бюро подразделения (если есть)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияХранитель</Name>
					<Comment>Организация, в которой подразделение хранит ТМЦ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговоеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКлассифайда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВОптовыхПродажах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДОиВР</Name>
					<Comment>Подразделение дополнительного оборудования и восстановительного ремонта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailСклада</Name>
					<Comment>Обезличеный Email склада (если есть)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАгент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаАвтохаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерепродажаАвто</Name>
					<Comment>Организация для перепродажи авто</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаркиАвтомобилей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Марка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Марка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДилера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/SM_УправлениеТабличнойЧастьюСоставы/Ext/Module.bsl
Процедура ДЦПриИзменении(Элемент,ЭтотОбъект,ЭтаФорма) Экспорт
	ДЦ				= ЭтотОбъект.ДЦ;
	Состав			= ЭтотОбъект.Состав;
	ЭлементыФормы	= ЭтаФорма.ЭлементыФормы; 
	
	Если Не обЗначениеНеЗаполнено(ДЦ) Тогда
		Если КоличествоПодчиненных(ДЦ) = 0 ИЛИ ДЦ.Код = "ЦБ001205" ИЛИ ДЦ.Код = "ЦБ001295" Тогда
			СМГ_Сообщить("Ошибка! Выбирать подразделение <"+ДЦ+"> запрещено. Поле будет очищено.");
			ДЦ = "";
			Состав.Очистить();
			Возврат;
		Иначе
			ЭлементыФормы.Состав.ТолькоПросмотр = Ложь;
			КоманднаяПанель1Заполнить(ЭтотОбъект);
			КоманднаяПанель1Распределить(ЭтотОбъект); 
		КонецЕсли;
	Иначе	
		ЭлементыФормы.Состав.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура ДЦНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка,ЭтотОбъект,ЭтаФорма) Экспорт
	СтандартнаяОбработка	= Ложь;
	ЭлементыФормы			= ЭтаФорма.ЭлементыФормы;
	
  	ЭлементыФормы.ДЦ.СписокВыбора.Очистить();
	СписокВыбора = Новый СписокЗначений; 
 	СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокДЦ(ЭтотОбъект).ВыгрузитьКолонку("ГруппаПодразделений"));
	СписокВыбора.Вставить(0,Справочники.ПодразделенияКомпании.ОсновноеПодразделение,Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Наименование);

 	ВыбранноеЗначение = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, ЭлементыФормы.ДЦ); 
 
	Если ВыбранноеЗначение <> Неопределено Тогда 
 		ЭтотОбъект.ДЦ = ВыбранноеЗначение.Значение;
   	КонецЕсли;
	
	ДЦПриИзменении(Элемент,ЭтотОбъект,ЭтаФорма);
КонецПроцедуры

Процедура ДЦОчистка(Элемент, СтандартнаяОбработка,ЭтотОбъект) Экспорт
	ЭтотОбъект.АдресДоставки = "";
	ЭтотОбъект.Состав.Очистить();
КонецПроцедуры 

Процедура КоманднаяПанель1Заполнить(ЭтотОбъект) Экспорт
	ДЦ			= ЭтотОбъект.ДЦ;
	Состав		= ЭтотОбъект.Состав;
	ЗаказчикФИО = ЭтотОбъект.ЗаказчикФИО;
	
	Если обЗначениеНеЗаполнено(ДЦ) Тогда
		СМГ_Сообщить("ОШИБКА! Не заполнен реквизит <ДЦ>",СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	Состав.Очистить();
	Если ДЦ = Справочники.ПодразделенияКомпании.ОсновноеПодразделение Тогда
		ТаблицаДЦ = ПолучитьСписокДЦ(ЭтотОбъект);
		Состав.Загрузить(ТаблицаДЦ);
	Иначе
 		НоваяСтрока = Состав.Добавить();
		НоваяСтрока.ГруппаПодразделений = ДЦ;
	КонецЕсли;

	Для каждого Строка Из Состав Цикл                
		ЗаполнитьДанныеГруппыПодразделений(Строка,ЭтотОбъект);
	КонецЦикла;            
КонецПроцедуры

Процедура КоманднаяПанель1Распределить(ЭтотОбъект) Экспорт
	Состав					= ЭтотОбъект.Состав;
	ТЧСоставКоличествоСтрок = Состав.Количество();
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ПлатежноеПоручение") Тогда 
		СуммаДокумента = ЭтотОбъект.СуммаДокумента;
		
		Если ТЧСоставКоличествоСтрок > 0 Тогда
			ДоляДЦ = СуммаДокумента / ТЧСоставКоличествоСтрок; 
			
			Для Каждого Строка Из Состав Цикл
				Строка.СуммаГруппыПодразделений = ДоляДЦ;
			КонецЦикла;
			
			Невязка = СуммаДокумента - Состав.Итог("СуммаГруппыПодразделений");
			
			Если Невязка <> 0 Тогда
				Состав[0].СуммаГруппыПодразделений = Состав[0].СуммаГруппыПодразделений + Невязка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ТЧСоставКоличествоСтрок > 0 Тогда  
			Товары				= ЭтотОбъект.Товары;
			ТЧТоварыИтогСумма	= Товары.Итог("Сумма");
			
			ДоляДЦ = ТЧТоварыИтогСумма / ТЧСоставКоличествоСтрок;
			Для Каждого Строка Из Состав Цикл
				Строка.СуммаГруппыПодразделений = ДоляДЦ;
			КонецЦикла;
			
			Невязка = ТЧТоварыИтогСумма - Состав.Итог("СуммаГруппыПодразделений");
			
			Если Невязка <> 0 Тогда
				Состав[0].СуммаГруппыПодразделений = Состав[0].СуммаГруппыПодразделений + Невязка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры    

Функция ПолучитьСписокДЦ(ЭтотОбъект) Экспорт
	ДокументОснование = ЭтотОбъект.ДокументОснование;
	Организация		  = ЭтотОбъект.Организация;
	
	Запрос = Новый Запрос;
 	Запрос.Текст = 	"ВЫБРАТЬ
 	               	|	ВыпискаСостав.Сделка КАК Сделка,
 	               	|	ВыпискаСостав.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
 	               	|	ВыпискаСостав.СтатьяДДС КАК СтатьяДДС
 	               	|ИЗ
 	               	|	Документ.Выписка.Состав КАК ВыпискаСостав
 	               	|ГДЕ
 	               	|	НЕ ВыпискаСостав.Ссылка.ПометкаУдаления
 	               	|	И ВыпискаСостав.Сделка = &Сделка
 	               	|	И ВыпискаСостав.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДДС.КомиссияИнкассация)";
 	Запрос.УстановитьПараметр("Сделка", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		              |	ПодразделенияКомпании.Ссылка КАК Ссылка,
		              |	ПодразделенияКомпании.ПометкаУдаления КАК ПометкаУдаления,
		              |	ПодразделенияКомпании.Родитель КАК ГруппаПодразделений,
		              |	ПодразделенияКомпании.Организация КАК Организация,
		              |	ПодразделенияКомпании.ОПЗарегистрировано КАК ОПЗарегистрировано
		              |ИЗ
		              |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		              |ГДЕ
		              |	ПодразделенияКомпании.ОПЗарегистрировано
		              |	И НЕ ПодразделенияКомпании.ПометкаУдаления
		              |	И ПодразделенияКомпании.Организация = &Организация";
 		Запрос.УстановитьПараметр("Организация", Организация);
		ТаблицаЗначений = Запрос.Выполнить().Выгрузить(); 
		Возврат ТаблицаЗначений;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодчиненныеПодразделения.КолРазличных КАК КолРазличных,
		|	ПодчиненныеПодразделения.Родитель КАК ГруппаПодразделений
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодразделенияКомпании.Ссылка) КАК КолРазличных,
		|			ПодразделенияКомпании.Родитель КАК Родитель
		|		ИЗ
		|			Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПодразделенияКомпании.Родитель) КАК ПодчиненныеПодразделения
		|		ПО ПодразделенияКомпании.Ссылка = ПодчиненныеПодразделения.Родитель
		|ГДЕ
		|	ПодчиненныеПодразделения.КолРазличных > 0
		|	И НЕ ПодчиненныеПодразделения.Родитель = &КомпанияВЦелом
		|	И НЕ ПодчиненныеПодразделения.Родитель.ПометкаУдаления
		|	И НЕ ПодчиненныеПодразделения.Родитель.Код = ""ЦБ001205""
		|	И НЕ ПодчиненныеПодразделения.Родитель.Код = ""ЦБ001295""
		|	И НЕ ПодчиненныеПодразделения.Родитель.Код = ""ЦБ001525""
		|	И НЕ ПодчиненныеПодразделения.Родитель.Код = ""ЦБ001588""
		|	И НЕ ПодчиненныеПодразделения.Родитель.Код = ""ЦБ000117""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодчиненныеПодразделения.Родитель.Наименование";
	
	Запрос.УстановитьПараметр("КомпанияВЦелом",Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	ТаблицаЗначений =  Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗначений;
КонецФункции   

Функция КоличествоПодчиненных(Родитель)	Экспорт
	Количество = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодразделенияКомпании.Ссылка) КАК КолРазличных,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель = &Родитель
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодразделенияКомпании.Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество = Количество + ВыборкаДетальныеЗаписи.КолРазличных;
	КонецЦикла;
	
	Возврат Количество;
КонецФункции

Процедура Очистить(ЭтотОбъект) Экспорт
	Состав	= ЭтотОбъект.Состав;
	
	Если Состав.Количество() > 0 Тогда
 		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Очистить таблицу ?", Режим, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Состав.Очистить();	
		КонецЕсли;
 	КонецЕсли;
КонецПроцедуры  

Процедура ЗаказчикФИОПриИзменении(Элемент,ЭтотОбъект) Экспорт
	Состав		= ЭтотОбъект.Состав;
	ЗаказчикФИО = ЭтотОбъект.ЗаказчикФИО;
	
 	Для Каждого Строка Из Состав Цикл
 		Строка.ЗаказчикФИОГруппыПодразделений = ЗаказчикФИО;
 	КонецЦикла;  
КонецПроцедуры

Процедура ЗаказчикФИООчистка(Элемент,СтандартнаяОбработка,ЭтотОбъект) Экспорт
	Состав	= ЭтотОбъект.Состав;
	
 	Для Каждого Строка Из Состав Цикл
 		Строка.ЗаказчикФИОГруппыПодразделений = "";
 	КонецЦикла;  
КонецПроцедуры  

Процедура СоставГруппаПодразделенийПриИзменении(Элемент,ЭтотОбъект,ЭтаФорма) Экспорт
	ЭлементыФормы	= ЭтаФорма.ЭлементыФормы;
	ТекущаяСтрока	= ЭлементыФормы.Состав.ТекущиеДанные;
	ЗаказчикФИО		= ЭтотОбъект.ЗаказчикФИО;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ГруппаПодразделений) Тогда
		ЗаполнитьДанныеГруппыПодразделений(ТекущаяСтрока,ЭтотОбъект);
		КоманднаяПанель1Распределить(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура СоставПередНачаломДобавления(Элемент,Отказ,Копирование,ЭтотОбъект) Экспорт
	Отказ = Копирование;
КонецПроцедуры   

Функция ПолучитьСписокПодразделенийГКПоследнийУровень()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияГК.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ УровеньПервый
		|ИЗ
		|	Справочник.ПодразделенияГК КАК ПодразделенияГК
		|ГДЕ
		|	ПодразделенияГК.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияГК.ГКСоколМоторс)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияГКУровень3.Ссылка КАК Ссылка
		|ИЗ
		|	УровеньПервый КАК УровеньПервый
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияГК КАК ПодразделенияГКУровень2
		|		ПО УровеньПервый.Ссылка = ПодразделенияГКУровень2.Родитель
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияГК КАК ПодразделенияГКУровень3
		|		ПО (ПодразделенияГКУровень2.Ссылка = ПодразделенияГКУровень3.Родитель)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
КонецФункции    

Процедура СоставГруппаПодразделенийНачалоВыбора(Элемент, СтандартнаяОбработка,ЭтаФорма,ЭтотОбъект) Экспорт
	Если Элемент.Значение <> Неопределено И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ПодразделенияГК") И Не ЗначениеЗаполнено(Элемент.Значение) Тогда 
		СтандартнаяОбработка = Ложь;
		СписокПодразделенийГК = ПолучитьСписокПодразделенийГКПоследнийУровень();
		
		ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ФормаВыбораЗначений");
		ФормаВыбора.ТаблицаЗначений = СписокПодразделенийГК; 
		ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			ТекущиеДанные = ЭтаФорма.ЭлементыФормы.Состав.ТекущиеДанные;
			ТекущиеДанные.ГруппаПодразделений = ВыбранноеЗначение;
			ЗаполнитьДанныеГруппыПодразделений(ТекущиеДанные,ЭтотОбъект);
			КоманднаяПанель1Распределить(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

Процедура ЗаполнитьДанныеГруппыПодразделений(ТекущиеДанные,ЭтотОбъект) Экспорт
	ЗаказчикФИО = ЭтотОбъект.ЗаказчикФИО; 
	
	Если ТипЗнч(ТекущиеДанные.ГруппаПодразделений) = Тип("СправочникСсылка.ПодразделенияГК") Тогда
		АдресДоставкиГруппыПодразделений = киПолучитьПредставлениеКИ(ТекущиеДанные.ГруппаПодразделений,Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если Не ЗначениеЗаполнено(АдресДоставкиГруппыПодразделений) Тогда       
			АдресДоставкиГруппыПодразделений = киПолучитьПредставлениеКИ(ТекущиеДанные.ГруппаПодразделений.Родитель,Справочники.ВидыКонтактнойИнформации.АдресФактический);
		КонецЕсли;                                                         
		ТекущиеДанные.АдресДоставкиГруппыПодразделений = АдресДоставкиГруппыПодразделений;
	ИначеЕсли ТипЗнч(ТекущиеДанные.ГруппаПодразделений) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		ТекущиеДанные.АдресДоставкиГруппыПодразделений	= киПолучитьПредставлениеКИ(ТекущиеДанные.ГруппаПодразделений,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	КонецЕсли;    
	
	ТекущиеДанные.ЗаказчикФИОГруппыПодразделений	= ЗаказчикФИО;	
КонецПроцедуры
